<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"4dc45feb6b1a515702d5c5117f6bbd33a2eabbac0bc557f2c8d710837909457a","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1213 at https://github.com/cal-itp/data-infra/actions/runs/20318140791","plan_out_hash":"b024d09a9991f5c838416475753172319a332bef3a18148cae34cee82c5c696f","plan_hash":"a473cac9e001c0c77934a0a3026e9b6c196e08f570e5035a7d0c2c663e4ea19e","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 4 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["dags/dbt_manual_dag.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "/SQyEw==" -> (known after apply)
!~      detect_md5hash      = "PS6O2bAmQG8Pmb24efxDgA==" -> "different hash"
!~      generation          = 1763432903392720 -> (known after apply)
        id                  = "calitp-composer-dags/dbt_manual_dag.py"
!~      md5hash             = "PS6O2bAmQG8Pmb24efxDgA==" -> (known after apply)
        name                = "dags/dbt_manual_dag.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "QDl/Bw==" -> (known after apply)
!~      detect_md5hash      = "sPo/Lv7HFWQMOYr4cMXC3g==" -> "different hash"
!~      generation          = 1765308835158608 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "sPo/Lv7HFWQMOYr4cMXC3g==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/intermediate/gtfs/int_gtfs_rt__trip_updates_trip_stop_day_map_grouping.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "b+mqng==" -> (known after apply)
!~      detect_md5hash      = "yJUh/Od0p1Q4ScChXQ1Y1g==" -> "different hash"
!~      generation          = 1758311273862797 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/intermediate/gtfs/int_gtfs_rt__trip_updates_trip_stop_day_map_grouping.sql"
!~      md5hash             = "yJUh/Od0p1Q4ScChXQ1Y1g==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/gtfs/int_gtfs_rt__trip_updates_trip_stop_day_map_grouping.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "X/LhEA==" -> (known after apply)
!~      detect_md5hash      = "p+XEZu0zg+0oZ772e6YTlQ==" -> "different hash"
!~      generation          = 1765308836645014 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "p+XEZu0zg+0oZ772e6YTlQ==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1213](https://github.com/cal-itp/data-infra/actions/runs/20318140791)